Documents/УДАЛИТЬ_ИсходящийКонтакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УДАЛИТЬ_ИсходящийКонтакт</Name>
			<Comment>Наше обращение к клиенту</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КонверсияВходящихКонтактов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяКлиента</Name>
					<Comment>Имя клиента, от которого произошло обращение</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотовыйТелефонКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочтаКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеТелефоныКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеРезультатаИсходящегоКонтакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоясненияРезультатаИсходящегоКонтакта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемоеВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийКонтакт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_ВходящийКонтакт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УДАЛИТЬ_ИсходящийКонтакт/Forms/ФормаДокумента/Ext/Form/Module.bsl
//НА СЕРВЕРЕ
&НаСервере
Функция ПолучитьРезультатОтказ()
	
	Возврат Справочники.РезультатыКонтактов.Отказ
	
КонецФункции

&НаСервере
Функция ПолучитьРезультатЗамер()
	
	Возврат Справочники.РезультатыКонтактов.Замер
	
КонецФункции

&НаСервере
Функция ПолучитьРезультатПерезвонить()
	
	Возврат Справочники.РезультатыКонтактов.Перезвонить
	
КонецФункции

&НаСервере
Процедура ВызватьПроведениеДокумента()
	Объект.Ссылка.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПоясненийРезультата()
	
	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоясненияРезультатаИсходящегоКонтакта.Ссылка
	|ИЗ
	|	Справочник.ПоясненияРезультатаИсходящегоКонтакта КАК ПоясненияРезультатаИсходящегоКонтакта
	|ГДЕ
	|	ПоясненияРезультатаИсходящегоКонтакта.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		Результат.Добавить(РезультатЗапроса.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = НЕ ЗначениеЗаполнено(Объект.Ссылка);
	Если ЭтоНовый Тогда
		ОбщийМодуль.ЗаполнитьШапкуДокумента(Объект);
	Иначе 
		Если Объект.ПланируемаяДата > Дата(2000,01,01) Тогда 
			Элементы.ПланируемаяДата.ТолькоПросмотр = Истина;
			Элементы.ЗапланированноеВремя.ТолькоПросмотр = Истина;
		КонецЕсли;
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		Элементы.Замер.Видимость = Ложь;
		Элементы.Перезвонить.Видимость = Ложь;
		Элементы.Отказ.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.ЗаполнениеНаОсновании Тогда
		Объект.ТекстОбращения = Параметры.ТекстИсходящегоОбращения;
		Объект.ИмяКлиента = Параметры.ИмяКлиента;
		Объект.СотовыйТелефонКлиента = Параметры.СотовыйТелефонКлиента;
		Объект.ЭлектроннаяПочтаКлиента = Параметры.ЭлектроннаяПочтаКлиента;
		Объект.ПрочиеТелефоныКлиента = Параметры.ПрочиеТелефоныКлиента;
		Объект.ВходящийКонтакт = Параметры.ВходящийКонтакт
	КонецЕсли;
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);

КонецПроцедуры

//НА КЛИЕНТЕ
&НаКлиенте
Процедура ОбновитьОтображениеЭлементов()
	
	Если ПраваПользователей.РазрешеноИспользованиеСофтФона() Тогда
		Элементы.ПозвонитьПоНомеру.Видимость = Истина;
	Иначе
		Элементы.ПозвонитьПоНомеру.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборРезультатаПерезвонить(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборРезультатаОтказ(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	Попытка
		Объект.Результат = ПолучитьРезультатОтказ();
		Объект.ПояснениеРезультатаИсходящегоКонтакта = ВыбранныйЭлемент.Значение;
		Объект.Ответственный = ОбщийМодуль.ПолучитьСотрудникаПользователя(СокрЛП(ИмяПользователя()));
		ЭтаФорма.Записать();
		ВызватьПроведениеДокумента();
		ЭтаФорма.Закрыть(Объект.Ссылка);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображениеЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура Замер(Команда)
	Объект.Результат = ПолучитьРезультатЗамер();
	Объект.ПояснениеРезультатаИсходящегоКонтакта = "";
	Объект.Ответственный = ОбщийМодуль.ПолучитьСотрудникаПользователя(СокрЛП(ИмяПользователя()));
	ЭтаФорма.Записать();
	ВызватьПроведениеДокумента();
	
	ПараметрыЗамера = Новый Структура;
	Если НЕ Объект.ВходящийКонтакт.Пустая() Тогда
		ПараметрыЗамера.Вставить("Основание", Объект.ВходящийКонтакт);
	Иначе
		ПараметрыЗамера.Вставить("Основание", Объект.Ссылка);
	КонецЕсли;
	
	ФормаЗамера = ПолучитьФорму("Документ.Замер.ФормаОбъекта",ПараметрыЗамера);
	ФормаЗамера.Открыть();
	
	ЭтаФорма.Закрыть(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура Перезвонить(Команда)
	СписокВариантов = ПолучитьСписокПоясненийРезультата();
	Если СписокВариантов = Неопределено Тогда
		Состояние("Ошибка получения пояснений результата контакта");
		Возврат;
	КонецЕсли;
	Если СписокВариантов.Количество() = 0 Тогда
		Состояние("Не заполнен справочник пояснений результата контакта. Документ не записан");
		Возврат;
	КонецЕсли;
		
	Оп = Новый ОписаниеОповещения("ВыборРезультатаПерезвонить", ЭтаФорма);
	ПоказатьВыборИзМеню(Оп, СписокВариантов, Элементы.Перезвонить);
КонецПроцедуры

&НаКлиенте
Процедура Отказ(Команда)
	СписокВариантов = ПолучитьСписокПоясненийРезультата();
	Если СписокВариантов = Неопределено Тогда
		Состояние("Ошибка получения списка причин отказа");
		Возврат;
	КонецЕсли;
	Если СписокВариантов.Количество() = 0 Тогда
		Состояние("Не заполнен справочник причин отказа. Документ не записан");
		Возврат;
	КонецЕсли;
		
	Оп = Новый ОписаниеОповещения("ВыборРезультатаОтказ", ЭтаФорма);
	ПоказатьВыборИзМеню(Оп, СписокВариантов, Элементы.Отказ);

КонецПроцедуры


&НаКлиенте
Процедура ПозвонитьПоНомеру(Команда)
	СофтФонКлиент.ПозвонитьПоНомеру(Объект.СотовыйТелефонКлиента, Объект.ИмяКлиента);
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры
